Repository: 84000/data-translation-memory
Catalog: toh74-v3.tmx
Source language: bo
Languages: en

source: བློ་གྲོས་བཟང་མོ་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་གང་གི་ཚིག་བླ་དགས་ཡིན།
en: Mañjuśrī asked, “Sumati, to what does the term bodhisattva refer?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་ནི་ནམ་མཁའ་དང་མཉམ་པ་ཉིད་ཀྱི་ཆོས་ཀྱི་ཚིག་བླ་དགས་སོ། །
en: Sumati replied, “Mañjuśrī, the term bodhisattva refers to a dharma that has the same nature as space.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བློ་གྲོས་བཟང་མོ་ཅི་དེ་བཞིན་གཤེགས་པ་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་མཛད་དམ།
en: “Sumati,” Mañjuśrī asked, “did the Tathāgata also perform acts for the sake of awakening?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་དཔེར་ན་སྨིག་རྒྱུ་དང་བྲག་ཅས་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་པ་དེ་བཞིན་དུ་དེ་བཞིན་གཤེགས་པས་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་སྤྱོད་དོ། །
en: “Just as a mirage or an echo acts for the sake of awakening,” Sumati replied, “the Tathāgata acted in the same way for the sake of awakening.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བློ་གྲོས་བཟང་མོ་ཁྱོད་ཀྱིས་ཅི་ལས་བསམས་ཏེ་དེ་སྐད་ཅེས་སྨྲས།
en: “What were you thinking of, Sumati, when you said this?”

source: འཇམ་དཔལ་འདི་ལ་ཆོས་འགའ་ལ་ཡང་བསམ་པ་འམ། བསམ་པ་མ་ལགས་པ་མ་མཆིས་སོ། །
en: “About this, Mañjuśrī,” Sumati replied, “I was neither thinking nor not thinking of any dharma whatsoever.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བློ་གྲོས་བཟང་མོ་བསམ་པ་དེ་ལྟ་བུ་ཡིན་དུ་ཟིན་ན་བྱིས་པ་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཏུ་འགྱུར་རོ། །བློ་གྲོས་བཟང་མོས་སྨྲས་པ།
en: “If it is as you think, Sumati,” Mañjuśrī said, “then every childish being would be awakened.”

source: འཇམ་དཔལ་འདི་ཇི་སྙམ་དུ་དགོངས།
en: “What do you think, Mañjuśrī?”

source: བྱིས་པ་རྣམས་ཀྱང་གཞན་ལ་མཁས་པ་རྣམས་ཀྱང་གཞན་ཏེ་བྱང་ཆུབ་ཀྱང་གཞན་པར་དེ་ལྟར་གཟིགས་སམ།
en: Sumati replied. “Do you see childish beings as different from the wise, and awakening too as different from them?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་དུ་འདི་ནི་དབྱིངས་གཅིག་པ་ལགས་ཏེ།
en: If you wonder why I say this, it is because the dharmadhātu contains only one constituent element.

source: བླང་བ་མ་མཆིས་ཤིང་དོར་བ་མ་མཆིས་ལ་སྒྲོ་བཏགས་པ་མ་མཆིས་སོ། །
en: When there is nothing to take up and nothing to cast away, there is nothing to superimpose on anything else.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བློ་གྲོས་བཟང་མོ་བཤད་པ་འདིའི་དོན་ཤེས་པ་ཇི་སྙེད་ཅིག་ཡོད།
en: Mañjuśrī asked, “Sumati, how many understand the meaning of what you have said?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་བཤད་པ་འདིའི་དོན་འཚལ་བ་ནི་སྒྱུ་མ་སྤྲུལ་པའི་སེམས་དང་སེམས་ལས་བྱུང་བ་ཇི་སྙེད་མཆིས་པ་དེ་སྙེད་དོ། །
en: Sumati replied, “Mañjuśrī, the number of those who understand the meaning of what I have said is equal in number to the minds and mental factors of illusory beings created by magic.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། བློ་གྲོས་བཟང་མོ་སྤྲུལ་པ་ཉིད་ཀྱང་མེད་ན་དེའི་སེམས་དང་སེམས་ལས་བྱུང་བ་ལྟ་ག་ལ་ཡོད།
en: “Sumati,” Mañjuśrī asked, “if illusory beings themselves do not even exist, how can their minds and mental factors exist?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་ཆོས་ཀྱི་དབྱིངས་ནི་མཆིས་པ་ཡང་མ་ལགས། མ་མཆིས་པ་ཡང་མ་ལགས་ཏེ། དེ་བཞིན་གཤེགས་པ་ཡང་དེ་དང་འདྲའོ། །
en: “Mañjuśrī,” Sumati replied, “the dharmadhātu is neither existent nor nonexistent, and the Tathāgata is like that too.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟར་བུ་མོ་བློ་གྲོས་བཟང་མོ་འདི་ཟབ་མོའི་བཟོད་པ་དང་ལྡན་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: Mañjuśrī Kumārabhūta then said this to the Bhagavān: “The extent to which the girl Sumati has an acceptance of the profound is truly marvelous, Bhagavān!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་དེ་བཞིན་ནོ། །
en: “It is just so, Mañjuśrī.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: It is just as you have said,” replied the Bhagavān.

source: བུ་མོ་བློ་གྲོས་བཟང་མོ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་ནས་བསྐལ་པ་སུམ་ཅུ་ལོན་པའི་འོག་ཏུ་གདོད་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: “Within thirty eons from the time that the girl Sumati became well established on the path to perfect and complete awakening, I first conceived the aspiration for unsurpassable, perfect, and complete awakening.

source: ཁྱོད་ཀྱང་བུ་མོ་བློ་གྲོས་བཟང་མོ་འདི་ཉིད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་ཞུགས་པར་བྱས་སོ། །
en: You, too, were introduced to the idea that things do not arise by this same girl, Sumati.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་སྟན་ལས་ལངས་ཏེ་བུ་མོ་བློ་གྲོས་བཟང་མོ་ལ་ཕྱག་བྱས་ནས་ཚིག་འདི་སྐད་དུ་བདག་གིས་སློབ་དཔོན་ཡུན་རིང་མོ་ཞིག་ན་མཐོང་ཞེས་ཀྱང་སྨྲས་སོ། །
en: At that point, Mañjuśrī Kumārabhūta rose from his seat, bowed to the girl Sumati, and spoke these words: “I am seeing my teacher after a long time.”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་མ་རྟོག་ཤིག །
en: “Do not form a concept, Mañjuśrī,” Sumati replied.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Why do I say this?

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ནི་རྣམ་པར་མི་རྟོག་པའི་ཕྱིར་རོ། །
en: It is because the acceptance of the fact that things do not arise is not something conceptual.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ཅིའི་ཕྱིར་སློབ་དཔོན་གྱིས་བུད་མེད་ཀྱི་ལུས་ལས་ད་དུང་མ་བསྒྱུར།
en: Mañjuśrī asked, “Why has my teacher not yet transformed herself from her female body?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་འདི་ནི་བུད་མེད་དོ། །འདི་ནི་སྐྱེས་པའོ་ཞེས་བྱ་བ་དེ་ནི་དམིགས་པ་སྟེ།
en: “Mañjuśrī,” responded Sumati, “to say that ‘this is a woman’ or ‘this is a man’ implies an objective basis.

source: འོན་ཀྱང་ཁྱོད་ཀྱི་ཐེ་ཚོམ་མེད་པར་བྱའོ། །
en: However, your doubt should be removed.

source: བདེན་པ་གང་གིས་བདག་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་བའི་བདེན་པ་དེས་བདག་སྐྱེས་པར་གྱུར་ཅིག །
en: By the truth, that is, by the truth that I will become a tathāgata, a perfect and complete buddha in the future, may I become a man.”

source: བུ་མོ་བློ་གྲོས་བཟང་མོས་ཚིག་དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ་དེའི་མོད་ལ་དེའི་བུད་མེད་ཀྱི་དངོས་པོ་མི་སྣང་བར་གྱུར་ནས་སྐྱེས་པར་རེད་དེ་ཆོས་གོས་ངུར་སྨྲིག་གྱོན་ནས་དེས་འདི་སྐད་དུ་བདེན་པ་གང་གིས་བདག་གིས་བྱང་ཆུབ་ཐོབ་པ་ན་དགེ་སློང་ཚུར་ཤོག་ཅེས་བྱས་པས་རབ་ཏུ་འབྱུང་བར་འགྱུར་བ་དང་། བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདུད་ཀྱང་འབྱུང་བར་མི་འགྱུར་བ་དང་། ངན་སོང་གི་མིང་ཡང་མེད་པ་དང་། བུད་མེད་ཀྱི་སྐྱོན་རྣམས་ཀྱང་མེད་པར་འགྱུར་བའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་བདག་དགེ་སློང་བསྙེན་པར་རྫོགས་ནས་ལོ་སུམ་ཅུ་ལོན་པའི་སྤྱོད་ལམ་ཅི་འདྲ་བ་དེ་ལྟ་བུར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: As soon as the girl Sumati uttered these words her female body vanished and she was transformed into a man wearing saffron-colored monastic robes, who then spoke these words: “By the truth that when I attain awakening, ordinations will occur through my utterance of the words ‘Come, monk,’ and no Māra will exist in my buddha realm, not even the name of the lower realms will exist there, and the faults of women will also not exist there—by that truth, and by those words of truth, may my demeanor become just like the demeanor of a monk who has been ordained for thirty years.”

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོས་ཚིག་འདི་སྐད་སྨྲས་མ་ཐག་ཏུ་དེའི་མོད་ལ་དགེ་སློང་བསྙེན་པར་རྫོགས་ནས་ལོ་སུམ་ཅུ་ལོན་པའི་སྤྱོད་ལམ་ཅི་འདྲ་བ་དེ་ལྟ་བུར་གྱུར་ཏོ། །འཇམ་དཔལ་བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་སེམས་ཅན་རྣམས་ཀྱི་ལུས་གསེར་གྱི་ཁ་དོག་ལྟ་བུར་འགྱུར་བ་དང་། བསམ་པས་བཟའ་བ་དང་བཏུང་བ་འགྲུབ་པར་འགྱུར་ཏེ། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་།
en: As soon as these words had been uttered, the demeanor of the bodhisattva Sumati became just like that of someone who had been ordained as a monk for thirty years.

source: ཡོངས་སུ་སྤྱོད་པ་ཇི་ལྟ་བ་བཞིན་དུ་འགྱུར་བ་དང་། །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ངན་སོང་གསུམ་ཡོངས་སུ་སྤངས་པར་འགྱུར་བ་དང་། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་ལྗོན་པ་དང་། རིན་པོ་ཆེའི་དྲ་བས་ཡོངས་སུ་བསྐོར་ཅིང་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་པདྨ་དག་གིས་རྒྱས་ལ་སྟེང་རིན་པོ་ཆེའི་བླ་རེ་བྲེས་ཏེ། འཇམ་དཔལ་གྱི་སངས་རྒྱས་ཀྱི་ཞིང་ཅི་འདྲ་བ་ཁོ་ན་དང་མཉམ་ཞིང་མི་ལྷག་པ་དེ་ལྟ་བུར་འགྱུར་བའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་འཁོར་འདི་གསེར་གྱི་ཁ་དོག་ཅན་དུ་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: “Mañjuśrī,” continued the bodhisattva Sumati, “by the truth and the words of truth—that beings in my buddha realm will have golden-colored bodies, food and drink will be acquired there merely by wishing for it, and the riches and enjoyments there will be just like those of the gods in the Heaven of Making Use of Others’ Emanations; In that buddha realm, the three lower realms will not be included; and the trees there will be made of seven precious substances, it will be surrounded by jeweled lattices, ornamented with lotuses made of seven precious substances and with jeweled canopies spread above, and that it will be a superior realm at least equal to the buddha realm of Mañjuśrī—by that truth and by those words of truth, may this assembly become golden in color.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོས་ཚིག་དེ་སྐད་སྨྲས་མ་ཐག་ཏུ་དེའི་མོད་ལ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་གསེར་གྱི་ཁ་དོག་ཅན་དུ་གྱུར་ཏོ། །
en: As soon as the bodhisattva Sumati uttered these words, the entire assembly became golden in color.

source: དེ་ནས་ས་བླའི་ལྷ་རྣམས་ཀྱི་ལྷའི་ལུས་ཀྱིས་གཅིག་ནས་གཅིག་ཏུ་སྒྲ་བསྒྲགས་ཤིང་སྐད་ཀྱིས་གོ་བར་བྱས་ཏེ། ཀྱེ་མ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་བཟང་པོ་བྱང་ཆུབ་ཐོབ་པའི་སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ནི་དེ་ལྟ་བུར་འགྱུར་རོ་ཞེས་ཆེད་དུ་བརྗོད་པ་འདི་ཆེད་དུ་བརྗོད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་འདི་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ།
en: At that point, the divine multitude of sky-dwelling gods exclaimed and informed each other in these words: “O, the bodhisattva mahāsattva Sumati has just made an inspired utterance about the nature of the array of qualities of the buddha realm in which that bodhisattva will attain awakening!”

source: བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཡོན་ཏན་རིན་ཆེན་དཔལ་གྱི་སྙིང་པོ་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: The Bhagavān then said to Mañjuśrī Kumārabhūta, “Mañjuśrī, this bodhisattva Sumati will appear in the world as a tathāgata, an arhat, a perfect and complete buddha, perfect in knowledge and conduct, a sugata, a knower of the world, a supreme trainer of those who are ready to be trained, a teacher to gods and humans, a bhagavān, a buddha named Essence of Splendorous and Precious Qualities.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན། སྲོག་ཆགས་བྱེ་བ་ཕྲག་སུམ་ཅུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་ཡང་དག་པར་གནས་པར་གྱུར་ཏོ། །ལྷ་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་ནི་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་རྣམ་པར་དག་གོ །
en: When the Bhagavān gave this Dharma discourse, three hundred million beings became established in the state of not turning back from unsurpassable, perfect, and complete awakening; eight hundred million gods purified the eye of Dharma with respect to things, so that it became spotless and free of impurities; and one hundred thousand beings had a direct realization of knowledge.

source: སྲོག་ཆགས་བརྒྱ་སྟོང་གིས་ནི་ཡེ་ཤེས་མངོན་པར་རྟོགས་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་དགེ་སློང་བྱང་ཆུབ་ཀྱི་སེམས་ལས་ཕྱིར་མི་ལྡོག་པར་འདོད་པ་ལྔ་སྟོང་ཙམ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོའི་ལྷག་པའི་བསམ་པ་རྟོགས་ཤིང་དགེ་བའི་རྩ་བའི་ཆེ་བ་ཉིད་མཐོང་ནས་དེ་དག་རང་རང་གི་བླ་གོས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་ལ་གསོལ་ཏེ།
en: Around five thousand monks on the bodhisattva path, who wished not to turn back from the aspiration for awakening, realized the ambition of the bodhisattva Sumati and saw the greatness of the bodhisattva’s roots of virtue.

source: ལྷག་པའི་བསམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ནས་ཚིག་འདི་སྐད་དུ་བཅོམ་ལྡན་འདས་བདག་ཅག་གི་དགེ་བའི་རྩ་བ་འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་གྱུར་ཅིག་ཅེས་སྨྲས་སོ། །
en: So, all of them put their monastic robes on the body of the Bhagavān, and with their ambition directed toward unsurpassable, perfect, and complete awakening, they made the following dedication: “Bhagavān, may our roots of virtue be certain to lead to unsurpassable, perfect, and complete awakening.”

source: དགེ་སློང་དེ་དག་གིས་དགེ་བའི་རྩ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་མ་ཐག་ཏུ་བསྐལ་པ་དགུ་བཅུའི་འཁོར་བ་བསྙིལ་ཏེ་བོར་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གནས་པར་གྱུར་ཏོ། །
en: As soon as the monks dedicated their roots of virtue to unsurpassable, perfect, and complete awakening, after ninety eons of saṃsāra had passed and were left behind, they attained the state of not turning back from the unsurpassable, perfect, and complete awakening.

source: དེ་དག་ཐམས་ཅད་ཀྱང་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་ཏེ།
en: The Bhagavān also made a prophecy for all of them.

source: འཇམ་དཔལ་དགེ་སློང་འདི་དག་ནི་བསྐལ་པ་བཅུ་གཉིས་ན་བསྐལ་པ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་ལ་དེ་བཞིན་གཤེགས་པ་བཟོད་པར་དཀའ་བའི་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་ཅན་དུ་བསྐལ་པ་གཅིག་ལ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་ཏེ།
en: He said, “After twelve eons, Mañjuśrī, over the course of a single eon, an eon called Vimalaprabhāsa, all these monks will awaken to unsurpassable, perfect, and complete awakening. They will do so in the buddha realm of the Tathāgata Duṣprasaha in the world system called Mārīcī.

source: དེ་བཞིན་གཤེགས་པ་སྤོབས་པའི་རྒྱན་ཅེས་བྱ་བར་ཐམས་ཅད་མིང་འཐུན་པར་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ། །
en: All of them will appear as tathāgatas in that world and will have a single name: Adornment of Eloquence.

source: འཇམ་དཔལ་དེ་ལྟར་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་རྣམས་ལ་རྫུ་འཕྲུལ་ཆེན་པོ་བྱེད་པ་ཡིན་ནོ། །
en: “In that way, Mañjuśrī, this Dharma discourse will cause bodhisattva mahāsattvas and śrāvakas to become great in the possession of superhuman powers.

source: འཇམ་དཔལ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་བྱང་ཆུབ་འདོད་པ་གང་གིས་བསྐལ་པ་སྟོང་གི་བར་དུ་ཐབས་མཁས་པ་དང་མ་བྲལ་བས་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་སྤྱད་ལ་གང་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བྲིས་ནས་ཟླ་བ་ཕྱེད་ཀྱི་བར་དུ་ལན་རེ་བླགས་ན་བསོད་ནམས་ཀྱི་ཕུང་པོ་སྔ་མས་ནི་བསོད་ནམས་ཀྱི་ཕུང་པོ་འདིའི་བརྒྱའི་ཆར་ཡང་མི་ཕོད། སྟོང་གི་ཆ་དང་། བརྒྱ་སྟོང་གི་ཆ་དང་། བྱེ་བ་བརྒྱ་སྟོང་གི་ཆ་དང་།
en: “Even if sons and daughters from good families who aspire for awakening practice the six perfections with skillful means for a thousand eons, Mañjuśrī, their accumulation of merit will not equal even a hundredth, a thousandth, a hundred thousandth, or a thousand billionth of the merit accumulated by those who write down this Dharma discourse or listen to it even once during a half-month period.

source: གྲངས་དང་། བགྲང་བ་དང་། དཔེ་དང་རྒྱུར་ཡང་མི་བཟོད་དོ། །
en: No reckoning, calculation, analogy, or account would suffice to describe it.

source: འཇམ་དཔལ་དེ་བས་ན་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ལ་གཏད་ཀྱིས་ཁྱོད་འདུན་པར་གྱིས་ལ་སྔོན་གྱི་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ལས་བྱུང་བའི་མདོ་འདི་ལྟ་བུ་འདི་མ་འོངས་པའི་དུས་ན་ཟུང་ཤིག །
en: Therefore, Mañjuśrī, I am entrusting this Dharma discourse to you. You should take an interest in it. Such a sūtra has arisen from the vows of bodhisattvas from the past. Hold on to it in future times.

source: ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Understand it thoroughly.

source: ཆོངས་ཤིག །
en: Remember it.

source: ཤོད་ཅིག །
en: Teach it.

source: ལྷོགས་ཤིག །
en: Recite it.

source: སྟོན་ཅིག །
en: Demonstrate it.

source: གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་ཅིག །
en: Expound it extensively to others.

source: འཇམ་དཔལ་དཔེར་ན་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཇི་སྲིད་དུ་གནས་པ་དེ་སྲིད་དུ་རིན་པོ་ཆེ་སྣ་བདུན་མེད་པར་མི་འགྱུར་ལ། འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ཤི་ན་རིན་པོ་ཆེ་སྣ་བདུན་མེད་པར་འགྱུར་རོ། །
en: “Consider this analogy, Mañjuśrī. So long as a cakravartin king is alive, the seven treasures will not cease to exist, but when a cakravartin king dies, the seven treasures will cease to exist.

source: འཇམ་དཔལ་དེ་བཞིན་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་འདི་འཇིག་རྟེན་ན་ཇི་སྲིད་དུ་སྤྱོད་པ་དེ་སྲིད་དུ་དེ་བཞིན་གཤེགས་པའི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རིན་པོ་ཆེ་སྣ་བདུན་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་ཚུལ་ཐམས་ཅད་མེད་པར་མི་འགྱུར་ལ།
en: In the same way, Mañjuśrī, so long as a Dharma discourse like this one is practiced in this world, that is how long the seven precious constitutive factors of the awakening of the Tathāgata and all the principles of the qualities that are conducive to awakening will not cease to exist.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལྟ་བུ་འདི་མེད་པར་གྱུར་ན་དམ་པའི་ཆོས་ནུབ་པར་འགྱུར་རོ། །
en: When a Dharma discourse like this one ceases to exist, then the true Dharma will disappear.

source: འཇམ་དཔལ་དེ་བས་ན་མདོ་སྡེ་རིན་པོ་ཆེ་འདི་ལྟ་བུ་འདི་ཡི་གེར་བྲི་བ་དང་། ལུང་འབོགས་པ་དང་། བཅང་བ་དང་། བཀླག་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་བསྟན་པའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་བརྩོན་འགྲུས་བརྩམ་པར་བྱའོ། །
en: Therefore, Mañjuśrī, bodhisattva mahāsattvas should undertake heroic efforts to write down the words of a treasure of a sūtra like this one, to explain it, to remember it, to recite it, and to expound it extensively to others.

source: འདི་ནི་ངའི་རྗེས་སུ་བསྟན་པ་ཡིན་ནོ། །
en: This is my instruction.

source: ཕྱིས་འགྱོད་པ་ཅན་དུ་གྱུར་ཏ་རེ།
en: Do not feel regret in the future!

source: འདི་ནི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་བྱང་ཆུབ་འདོད་པ་ལ་ངས་བསྟན་པ་ཡིན་ནོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་པོ་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་དང་།
en: This is my instruction to sons and daughters from good families who aspire for awakening.”

source: ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ།
en: This is what the Bhagavān said, and the bodhisattva Sumati, Mañjuśrī Kumārabhūta, the entire assembly, and the whole world with its gods, humans, asuras, and gandharvas rejoiced and praised what the Bhagavān had said.

source: བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།། །།འཕགས་པ་དཀོན་མཆོག་བརྩེགས་པ་ཆེན་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ལེའུ་སྟོང་ཕྲག་བརྒྱ་པ་ལས་བུ་མོ་བློ་གྲོས་བཟང་མོས་ཞུས་པའི་ལེའུ་ཞེས་བྱ་སྟེ་སུམ་ཅུ་པ་རྫོགས་སོ།། །།
en: This concludes “The Inquiry of the Girl Sumati,” the thirtieth of the one hundred thousand chapters of the Dharma discourse known as “The Noble Great Heap of Jewels.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། སུ་རེན་དྲ་བོ་དྷི་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེ་ལ་སོགས་པས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: Translated, edited, and finalized by the Indian preceptors Jinamitra and Surendrabodhi, along with the chief editor and translator Bandé Yeshé Dé, and others.
